In [6]:
import pandas as pd
import openpyxl as xl

In [ ]:
#sheet_name ='Hoja donde estan los datos'
df_excel = pd.read_excel('/Users/Admin/Documents/proyectosAnalisisDatos/Pandas/dataframe_ejemplo.xlsx',sheet_name='Hoja1')
display(df_excel)

    Nombre  Edad     Ciudad
0   Yamith    28     Madrid
1    Doris    22  Barcelona
2  Mayerly    35   Valencia
3  Liliana    29    Sevilla

In [13]:
#Codigo para mirar las hojas del archivo excel
df_excel = pd.ExcelFile('/Users/Admin/Documents/proyectosAnalisisDatos/Pandas/dataframe_ejemplo.xlsx')
display(df_excel.sheet_names)

['Sheet1', 'Hoja1', 'Hoja2']

In [15]:
#Parar mirar todas las hojas
for sheet_names in df_excel.sheet_names:
    df = pd.read_excel(df_excel, sheet_name=sheet_names)
    print(f'Contenido de la hoja: {sheet_names}')
    display(df.head())

Contenido de la hoja: Sheet1

  Nombre  Edad     Ciudad
0   Juan    28     Madrid
1    Ana    22  Barcelona
2   Luis    35   Valencia
3  María    29    Sevilla

Contenido de la hoja: Hoja1

    Nombre  Edad     Ciudad
0   Yamith    28     Madrid
1    Doris    22  Barcelona
2  Mayerly    35   Valencia
3  Liliana    29    Sevilla

Contenido de la hoja: Hoja2

Empty DataFrame
Columns: []
Index: []

## Parámetros Comunes en pd.read_excel()

- *sheet_name:* Especifica la hoja a leer (puede ser nombre o índice).
- *header:* Indica la fila que contiene los nombres de las columnas (por defecto es la primera fila).
- *names:* Lista de nombres de columnas si el archivo no tiene encabezado.
- *skiprows:* Número de filas a omitir al comienzo del archivo.
- *nrows:* Número de filas a leer desde el archivo.
- *usecols:* Especifica las columnas a leer.

In [ ]:
#usecols='A:B' ayuda a escoger las comlu,nas que reuiero 
df_excel = pd.read_excel('/Users/Admin/Documents/proyectosAnalisisDatos/Pandas/datos.xlsx',sheet_name='Sheet1', usecols='A:B',skiprows=1,nrows=10)
display(df_excel)


df_excel = pd.read_excel('/Users/Admin/Documents/proyectosAnalisisDatos/Pandas/datos.xlsx',sheet_name='Sheet1')
display(df_excel.head())

     Ana  23
0   Juan  45
1  Pedro  34

  Nombre  Edad     Ciudad
0    Ana    23     Madrid
1   Juan    45  Barcelona
2  Pedro    34   Valencia

In [22]:
#Guardar mis datos a mi excel
datos = {
    'producto': ['manzana', 'banana', 'naranja', 'pera', 'uva', 'sandía', 'kiwi', 'mango', 'piña', 'fresa'],
    'precio': [1.20, 0.80, 1.00, 1.50, 2.00, 3.50, 2.20, 2.80, 3.00, 1.80],
    'stock': [50, 100, 80, 60, 40, 20, 30, 25, 15, 70]
}
df = pd.DataFrame(datos)

display(df.head())

  producto  precio  stock
0  manzana     1.2     50
1   banana     0.8    100
2  naranja     1.0     80
3     pera     1.5     60
4      uva     2.0     40

In [23]:
#Exportar a excel y guardar mi dataframe
df.to_excel('dataFrameEjemplo.xlsx',index= False)